clc;clear;
% -------------FxLMS--------------------%
sample_num = 1000;             % 采样点数
n = 1:sample_num;                    
N = 16;                         % 滤波器阶数
mu = 0.01;                      % 步长
Pw = [0.2, -0.001, 0.001, 0.4, 0.9, -0.1, -0.5, -0.03, 0.2, -0.05, ...
      0.05, -0.001, 0.01, 0.3, 0.06, -0.5, -0.5, -0.1, 0.4, -0.01, ...
      0.01, -0.003, 0.003, 0.4, 0.8, -0.2, -0.5, -0.1, 0.4, -0.05, ...
      0.2, -0.4];
Sw = [0.05, -0.4, 0.87, 0.1, -0.38, 0.01, 0.1, 0, 0, 0, 0, 0, 0, 0.04, 0, 0.6];    % 次级路径
f = 300;
fs = 2400;
 xn = sin(2*pi*f/fs*n);          % 输入信号
% xn = randn(1, sample_num);
dn = filter(Pw,1,xn);           % 期望信号

% 初始化变量
X = zeros(1, N);                % 输入信号
Y = zeros(1, N);                % 输入信号经滤波器
w = zeros(1, N);                % 滤波器
Ys = zeros(1, N);               % 经次级路径
Cx = zeros(1, N);               % 滤波矢量信号
en = zeros(1, sample_num);      % 误差信号

for k = 1:sample_num
    
     % 信号输入
    X(2:end) = X(1:end-1);
    X(1) = xn(k);
    
    % 滤波器输出信号
    Y(2:end) = Y(1:end-1);
    Y(1) = X*w';
    
    % 经次级路径
    Ys(2:end) = Ys(1:end-1);
    Ys(1) = Y*Sw';
    
    % 误差信号
    en(k) = dn(k) - Ys(1);
    
    % 滤波矢量信号
    Cx(2:end) = Cx(1:end-1);
    Cx(1) = X*Sw';
    
    % 更新滤波器
    w = w + mu*Cx*en(k);
    
    
end
figure(1);
plot(xn);
hold on;
plot(en);
legend('输入信号','误差信号');




